name: "clip_vision"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224]  # цветные изображения 3x224x224
  }
]

output [
  {
    name: "image_features"  
    data_type: TYPE_FP32
    dims: [-1, 512]  
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]