name: "clip_vision"
platform: "onnxruntime_onnx"
max_batch_size: 8
input [{ name: "pixel_values", data_type: TYPE_FP32, dims: [3, 224, 224] }]
output [{ name: "image_embeds", data_type: TYPE_FP32, dims: [512] }]
instance_group [{ count: 1, kind: KIND_CPU }]
