name: "nsfw_detector"
platform: "onnxruntime_onnx"
max_batch_size: 0  

input [
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224]  
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [-1, 2]  
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]