name: "clip_text"
platform: "onnxruntime_onnx"
max_batch_size: 16

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]  # sequence length, батч динамический
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]

output [
  {
    name: "text_embeds"
    data_type: TYPE_FP32
    dims: [512]  # размер эмбеддинга CLIP
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]