name: "clip_text"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [-1 , -1]  # sequence length, батч динамический
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [-1, -1 ]
  }
]

output [
  {
    name: "text_features"
    data_type: TYPE_FP32
    dims: [-1, 512]  # размер эмбеддинга CLIP
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]